app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "7"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Tim Burton'
---
  def same_director
    movie = Movie.find(params[:id])
    director_name = movie.director

    if not director_name or director_name.empty?
      flash[:notice] = %Q{'#{movie.title}' has no director info}
      redirect_to movies_path
    else
      @movies = Movie.find_all_by_director director_name